Revit 2027 API
StructuralConnectionApprovalType.Create Method
 Creates a new StructuralConnectionApprovalType.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static StructuralConnectionApprovalType Create(
	Document doc,
	string name
)
Public Shared Function Create (
	doc As Document,
	name As String
) As StructuralConnectionApprovalType
public:
static StructuralConnectionApprovalType^ Create(
	Document^ doc,
	String^ name
)
static member Create :
        doc : Document *
        name : string -> StructuralConnectionApprovalType
Parameters
doc Document
name String
 A name for the new approval type. It must be unique within the document.
Return Value
StructuralConnectionApprovalType
 Created connection approval type.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentsInconsistentException |  The input name for approval type is not unique in the document.
See Also
Reference
StructuralConnectionApprovalType Class
Autodesk.Revit.DB.Structure Namespace